# Dados absolutos e relativos

In [1]:
import pandas as pd

## Percentuais

In [2]:
dados = {'emprego':['Adminstrador_banco_dados', 'Programador', 'Arquiteto_redes'],
         'nova_jersey': [97350, 82080, 112840],
         'florida': [77140, 71540, 62310]}

In [3]:
type(dados)

dict

In [4]:
dados

{'emprego': ['Adminstrador_banco_dados', 'Programador', 'Arquiteto_redes'],
 'florida': [77140, 71540, 62310],
 'nova_jersey': [97350, 82080, 112840]}

In [5]:
dataset = pd.DataFrame(dados)

In [6]:
dataset

                    emprego  nova_jersey  florida
0  Adminstrador_banco_dados        97350    77140
1               Programador        82080    71540
2           Arquiteto_redes       112840    62310

In [7]:
dataset['nova_jersey'].sum()

292270

In [8]:
dataset['florida'].sum()

210990

In [9]:
#criando uma nova coluna | aqui temos a parte | dividindo |  pelo todo            | multiplicando por 100 para termos o valor em porcentagem
dataset['%_nova_jersey'] = (dataset['nova_jersey'] / dataset['nova_jersey'].sum()) * 100

In [10]:
dataset

                    emprego  nova_jersey  florida  %_nova_jersey
0  Adminstrador_banco_dados        97350    77140      33.308242
1               Programador        82080    71540      28.083621
2           Arquiteto_redes       112840    62310      38.608136

In [11]:
dataset['%_florida'] = (dataset['florida'] / dataset['florida'].sum()) * 100

In [14]:
dataset

                    emprego  nova_jersey  florida  %_nova_jersey  %_florida
0  Adminstrador_banco_dados        97350    77140      33.308242  36.560974
1               Programador        82080    71540      28.083621  33.906820
2           Arquiteto_redes       112840    62310      38.608136  29.532205

## Exercício percentuais

In [16]:
dataset = pd.read_csv('/content/sample_data/census.csv')

In [18]:
dataset.head()

   age          workclass  final-weight  ... hour-per-week  native-country  income
0   39          State-gov         77516  ...            40   United-States   <=50K
1   50   Self-emp-not-inc         83311  ...            13   United-States   <=50K
2   38            Private        215646  ...            40   United-States   <=50K
3   53            Private        234721  ...            40   United-States   <=50K
4   28            Private        338409  ...            40            Cuba   <=50K

[5 rows x 15 columns]

In [19]:
# A ideia é encontrar as porcentagens entre education e income(vms ver se existe uma relação entre elas, se uma pessoa que estuda mais ganha mais)
#criando um subdataset
dataset2 = dataset[['income', 'education']]

In [20]:
dataset2

       income    education
0       <=50K    Bachelors
1       <=50K    Bachelors
2       <=50K      HS-grad
3       <=50K         11th
4       <=50K    Bachelors
...       ...          ...
32556   <=50K   Assoc-acdm
32557    >50K      HS-grad
32558   <=50K      HS-grad
32559   <=50K      HS-grad
32560    >50K      HS-grad

[32561 rows x 2 columns]

In [22]:
#Você pode utilizar o comando groupby do pandas para agrupar os dados, ou seja, a quantidade de registros baseado nesses dois atributos
dataset3 = dataset2.groupby(['education', 'income'])['education'].count() #queremos fazer a contagem  da coluna education (para contar a quantidade por nivel de graduação)

In [23]:
dataset3

education      income
 10th           <=50K     871
                >50K       62
 11th           <=50K    1115
                >50K       60
 12th           <=50K     400
                >50K       33
 1st-4th        <=50K     162
                >50K        6
 5th-6th        <=50K     317
                >50K       16
 7th-8th        <=50K     606
                >50K       40
 9th            <=50K     487
                >50K       27
 Assoc-acdm     <=50K     802
                >50K      265
 Assoc-voc      <=50K    1021
                >50K      361
 Bachelors      <=50K    3134
                >50K     2221
 Doctorate      <=50K     107
                >50K      306
 HS-grad        <=50K    8826
                >50K     1675
 Masters        <=50K     764
                >50K      959
 Preschool      <=50K      51
 Prof-school    <=50K     153
                >50K      423
 Some-college   <=50K    5904
                >50K     1387
Name: education, dtype: int64

In [ ]:

dataset3.index

MultiIndex([(' <=50K',         ' 10th'),
            (' <=50K',         ' 11th'),
            (' <=50K',         ' 12th'),
            (' <=50K',      ' 1st-4th'),
            (' <=50K',      ' 5th-6th'),
            (' <=50K',      ' 7th-8th'),
            (' <=50K',          ' 9th'),
            (' <=50K',   ' Assoc-acdm'),
            (' <=50K',    ' Assoc-voc'),
            (' <=50K',    ' Bachelors'),
            (' <=50K',    ' Doctorate'),
            (' <=50K',      ' HS-grad'),
            (' <=50K',      ' Masters'),
            (' <=50K',    ' Preschool'),
            (' <=50K',  ' Prof-school'),
            (' <=50K', ' Some-college'),
            ( ' >50K',         ' 10th'),
            ( ' >50K',         ' 11th'),
            ( ' >50K',         ' 12th'),
            ( ' >50K',      ' 1st-4th'),
            ( ' >50K',      ' 5th-6th'),
            ( ' >50K',      ' 7th-8th'),
            ( ' >50K',          ' 9th'),
            ( ' >50K',   ' Assoc-acdm'),
            ( ' >50K',    ' Assoc-voc'),
            ( ' >50K',    ' Bachelors'),
            ( ' >50K',    ' Doctorate'),
            ( ' >50K',      ' HS-grad'),
            ( ' >50K',      ' Masters'),
            ( ' >50K',  ' Prof-school'),
            ( ' >50K', ' Some-college')],
           names=['income', 'education'])

In [ ]:
dataset3[' Bachelors', ' <=50K'], dataset3[' Bachelors', ' >50K']

(3134, 2221)

In [ ]:
3134 + 2221

5355

In [ ]:
# % >50K
(2221 / 5355) * 100

41.47525676937442

In [ ]:
# % <=50K
(3134 / 5355) * 100

58.52474323062559

## Exercício coeficientes e taxas

In [24]:
### O objetivo deste exercício é calcular o coeficiente e a taxa de evasão utilizando a tabela abaixo. Faça os cálculos manuais e depois implemente em Python

In [36]:
dados = {'ano': ['1', '2', '3', '4'],
          'Matrículas_março': [70, 50, 47, 23],
          'Matrículas_novembro': [65, 48, 40, 22]}

In [37]:
dados

{'Matrículas_março': [70, 50, 47, 23],
 'Matrículas_novembro': [65, 48, 40, 22],
 'ano': ['1', '2', '3', '4']}

In [38]:
dataset = pd.DataFrame(dados)

In [39]:
dataset

  ano  Matrículas_março  Matrículas_novembro
0   1                70                   65
1   2                50                   48
2   3                47                   40
3   4                23                   22

In [40]:
dataset['Taxa_evasão'] = ((dataset['Matrículas_março'] - dataset['Matrículas_novembro']) / dataset['Matrículas_março']) * 100

In [41]:
dataset

  ano  Matrículas_março  Matrículas_novembro  Taxa_evasão
0   1                70                   65     7.142857
1   2                50                   48     4.000000
2   3                47                   40    14.893617
3   4                23                   22     4.347826